Enums/ТаймфреймыСвечей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТаймфреймыСвечей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>_1Min</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_5Min</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_15Min</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_1Hour</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_Day</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_Week</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыИсточникаИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыИсточникаИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекущиеПозиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинИнструмент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеПозицииЗаПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокИнструментов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РежимыЗагрузкиСвечей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РежимыЗагрузкиСвечей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолнаяЗагрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дозагрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерезагрузкаПериода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РегламентныеЗаданияИнвестиций/Ext/Module.bsl
Процедура ЗагрузкаДневныхСвечей() Экспорт
    
    ПараметрыЗагрузки = Новый Структура;
    ПараметрыЗагрузки.Вставить("Таймфрейм", Перечисления.ТаймфреймыСвечей._Day);
    ПараметрыЗагрузки.Вставить("ВариантИсточникаИнструментов", Перечисления.ВариантыИсточникаИнструментов.ТекущиеПозиции);
    ПараметрыЗагрузки.Вставить("РежимЗагрузки", Перечисления.РежимыЗагрузкиСвечей.Дозагрузка);
    ПараметрыЗагрузки.Вставить("ДатаНачала", НачалоГода(ТекущаяДатаСеанса()));
    ПараметрыЗагрузки.Вставить("ДатаОкончания", ТекущаяДатаСеанса());
    ПараметрыЗагрузки.Вставить("Платформа", Справочники.Платформы.ТИнвестиции);
    ПараметрыЗагрузки.Вставить("Счет", Неопределено);
    ПараметрыЗагрузки.Вставить("СписокИнструментов", Неопределено);
    
    Результат = СвечиСервис.ЗагрузитьСвечи(ПараметрыЗагрузки);
	
	Уровень = ?(Результат.Ошибок = 0, УровеньЖурналаРегистрации.Информация, УровеньЖурналаРегистрации.Ошибка);
	
	Комментарий = "";
	Для Каждого КлючИЗначение Из Результат Цикл
		Комментарий = Комментарий + КлючИЗначение.Ключ + ": " + КлючИЗначение.Значение + Символы.ПС;
	КонецЦикла;
	ЗаписьЖурналаРегистрации("Загрузка дневных свечей", Уровень, Метаданные.РегламентныеЗадания.ЗагрузкаДневныхСвечей,, Комментарий);
    
КонецПроцедуры
